OpenFOAM-dev/tutorials/multiRegion/film/cylinder/0/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    film
    {
        type            fixedFluxPressure;
    }

    "(sides|frontAndBack)"
    {
        type            fixedFluxPressure;
    }

    top
    {
        type            prghTotalPressure;
        p0              $internalField;
    }
}

// ************************************************************************* //
